randread/1-node/randread1.log
random-readers: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=4
...
fio-3.27-32-g77c7-dirty
Starting 2 processes

random-readers: (groupid=0, jobs=1): err= 0: pid=105184: Tue Jul 20 11:10:42 2021
  read: IOPS=86, BW=2778KiB/s (2845kB/s)(814MiB/300007msec)
    slat (usec): min=732, max=167923, avg=11496.33, stdev=7353.75
    clat (usec): min=11, max=254504, avg=34554.13, stdev=12996.14
     lat (msec): min=9, max=296, avg=46.05, stdev=15.12
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   20], 10.00th=[   22], 20.00th=[   26],
     | 30.00th=[   28], 40.00th=[   30], 50.00th=[   33], 60.00th=[   35],
     | 70.00th=[   39], 80.00th=[   43], 90.00th=[   51], 95.00th=[   58],
     | 99.00th=[   78], 99.50th=[   89], 99.90th=[  114], 99.95th=[  140],
     | 99.99th=[  224]
   bw (  KiB/s): min= 1440, max= 3587, per=50.28%, avg=2779.46, stdev=251.33, samples=300
   iops        : min=   30, max=  124, avg=86.82, stdev= 9.76, samples=600
  lat (usec)   : 20=0.01%
  lat (msec)   : 4=0.01%, 10=0.15%, 20=6.08%, 50=83.53%, 100=10.02%
  lat (msec)   : 250=0.20%, 500=0.01%
  cpu          : usr=0.24%, sys=1.96%, ctx=26067, majf=0, minf=70
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=26049,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-readers: (groupid=0, jobs=1): err= 0: pid=105185: Tue Jul 20 11:10:42 2021
  read: IOPS=85, BW=2749KiB/s (2815kB/s)(805MiB/300024msec)
    slat (usec): min=750, max=187657, avg=11622.33, stdev=7666.42
    clat (usec): min=16, max=253084, avg=34931.20, stdev=13516.68
     lat (msec): min=9, max=263, avg=46.56, stdev=15.75
    clat percentiles (msec):
     |  1.00th=[   16],  5.00th=[   20], 10.00th=[   23], 20.00th=[   26],
     | 30.00th=[   28], 40.00th=[   31], 50.00th=[   33], 60.00th=[   35],
     | 70.00th=[   39], 80.00th=[   43], 90.00th=[   51], 95.00th=[   59],
     | 99.00th=[   82], 99.50th=[   94], 99.90th=[  144], 99.95th=[  165],
     | 99.99th=[  239]
   bw (  KiB/s): min= 1345, max= 3619, per=49.74%, avg=2749.63, stdev=264.26, samples=300
   iops        : min=   32, max=  126, avg=85.89, stdev=10.21, samples=600
  lat (usec)   : 20=0.01%
  lat (msec)   : 4=0.01%, 10=0.06%, 20=5.38%, 50=84.20%, 100=9.95%
  lat (msec)   : 250=0.40%, 500=0.01%
  cpu          : usr=0.17%, sys=1.96%, ctx=25789, majf=0, minf=71
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=25770,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=5527KiB/s (5660kB/s), 2749KiB/s-2778KiB/s (2815kB/s-2845kB/s), io=1619MiB (1698MB), run=300007-300024msec


Batch Job Summary Report (version 21.01.1) for Job "fioRandRead" (1471011) on tave

Job information (1/2)
-----------------------------------------------------------------------------------------------------
             Submit            Eligible               Start                 End    Elapsed Time limit
------------------- ------------------- ------------------- ------------------- ---------- ----------
2021-07-20T11:05:37 2021-07-20T11:05:37 2021-07-20T11:05:38 2021-07-20T11:10:44   00:05:06   00:15:00
-----------------------------------------------------------------------------------------------------

Job information (2/2)
-------------------------------------------------------------
    Username      Account    Partition   NNodes        Energy
------------ ------------ ------------ -------- -------------
    afilipci         g138       normal        1     38.813 kJ